{
    "data": {
      "group": {
        "name": "Manchester and North West Umbraco Meetup",
        "pastEvents": {
          "edges": [
            {
              "node": {
                "id": "303215839",
                "title": "Aaron Green - Confident Communication (And Why It Matters)",
                "description": "Join us for an inspiring talk by Aaron Green from iO Associates, who will share his personal journey of overcoming communication challenges and building confidence. As someone on the autism spectrum, Aaron has faced unique hurdles in establishing rapport and trust, particularly in professional settings.\n\nIn this session, he will delve into the principles of confident communication, drawing from his extensive research and personal experiences. Aaron will discuss how he transformed his anxiety in social situations into a powerful tool for connection, enabling him to thrive in a role that demands exceptional communication skills.\n\nHe'll explore the barriers that many technically skilled individuals face when it comes to securing senior roles, emphasising the importance of confidence in communication. Attendees will gain insights into how to enhance their communication skills, which can lead to better interactions, improved career prospects, and a more fulfilling professional life.\n\n### **Engaging Presentations:**\n\nAaron's talk will provide a fresh perspective on communication, blending personal anecdotes with practical advice. Expect to learn about belief systems, body language, and the science behind effective communication—all aimed at empowering you to take control of your interactions and career.\n\n### **Who Should Attend:**\n\nThis meetup is ideal for anyone looking to improve their communication skills, whether you're a seasoned professional or just starting in your tech career. It's a fantastic opportunity to learn from Aaron's experiences, share your own, and connect with others in the Umbraco community.\n\n### **Why It's Worth Attending:**\n\nThis event is not just about listening to a talk; it's about engaging with the community, gaining valuable insights, and fostering meaningful discussions around communication and personal development. Join us to expand your knowledge, network with peers, and be part of the vibrant Umbraco community.\n\n### **Agenda:**\n\n18:30 - Open for Mingling\n19:00 - Talk: **Confident Communication (And Why It Matters)**\n20:00 - Open Social + Refreshments\n\nEntry: Upon arrival at Cantarus, please check in at reception, where someone will guide you to the meetup location.\n\n**Please be aware:** Cantarus has moved offices, please check the map for their new location.",
                "dateTime": "2024-09-26T18:30+01:00"
              }
            },
            {
              "node": {
                "id": "301729565",
                "title": "Lightning Talks",
                "description": "We are thrilled to announce our detailed speaker line-up for the upcoming Umbraco meetup at Absurd. This event promises engaging sessions and into the latest trends and advancements.\n\n**Speaker line up**\n\n**Pritesh Tailor :** Say Yes to Delivering Value Early\n\nFollowing the completion of a rebuild using the strangler fig pattern, Pritesh will provide a short recap, share what he learned, and discuss the value of delivering value early. This session will offer practical insights into efficient project management and delivery.\n\n**Dan Lister :** Optimising Azure DevOps YAML Pipelines: Tips & Tricks\n\nJoin Dan for a focused lightning talk on maximizing the potential of Azure DevOps YAML pipelines. Learn practical tips and tricks to streamline your CI/CD processes, making your development workflow more efficient and productive. Whether you're new to YAML or looking to enhance your existing pipelines, this session offers valuable insights and actionable advice.\n\n**Christopher Menez :** Google Consent Mode\n\nChristopher will cover using Google Consent Mode within Google Tag Manager to manage consent on your website. This session will provide essential knowledge for anyone looking to enhance their website's compliance and user experience.\n\n**Imran Haider :** Static/Dynamic/Cache: Performance and Sustainability in Light of Modern Web Development\n\nExplore ideas on how minor tweaks to your site could better utilize caching services' functionality, potentially replicating some of the benefits of headless or static website development. Imran will discuss strategies for improving performance and sustainability in modern web development.\n\n**Agenda**\n\n* **18:30:** Open for social and mingling (food and drinks provided)\n* **19:00:** Lightning Talks\n* **20:45:** Open social\n\n**Entry:**\nGo to reception, there will be someone there to guide you to where the meetup is taking place.",
                "dateTime": "2024-07-18T18:30+01:00"
              }
            },
            {
              "node": {
                "id": "300879948",
                "title": "Headless talks with Adam Prendergast and Phil Whittaker ",
                "description": "**Bake, Don't Fry: Astro & The Content Delivery API -** Adam Prendergast\n\nThe Content Delivery API has revolutionised the possibilities for headless applications, including the creation of swift, scalable pre-rendered sites.\n\nIn this talk, Adam Prendergast will delve into the world of static site generation, with a focus on Astro as a leading framework.\nLearn how to transform Umbraco Data into a dynamic suite of TypeScript components using Astro, and discuss the benefits and pitfalls of 'incremental builds', streamlined publishing workflows, and cost-efficient hosting options.\n\nThis talk, which has been accepted for Codegarden, will leave you well-equipped to make informed decisions about integrating this innovative strategy into your projects.\n\n**Deep Dive into the Umbraco Headless Demo** \\- Phil Whittaker\n\nJoin Phil Whittaker as he explores one of Umbraco's most significant releases in recent years - the Umbraco Headless demo. This session will cover how to get set up, explain how the Umbraco Content, Commerce, and Forms Delivery APIs work, and how CMS content is mapped into page content with NextJs.\n\nKey concepts of Next.js and Vercel, including Server-Side Rendering (SSR), Static Site Generation (SSG), and Incremental Static Regeneration (ISR), will be introduced and their importance discussed. Lastly, we will explain how and why pages are efficiently updated when content is published in Umbraco.\n\n**Who should attend**\n\nWhether you're new to Umbraco or a seasoned professional, this event is perfect for anyone interested in the platform. It's a unique opportunity to gain insights into the latest developments, share experiences, and network with peers in the industry.\n\n**Why it's worth attending**\n\nThis Meetup is more than just listening to talks. It's a chance to connect with the community, learn from experts, and engage in meaningful discussions about Umbraco and software development. Attend to expand your knowledge, meet fellow enthusiasts, and be part of the vibrant Umbraco community.\n\n**Agenda**\n\n18:30 - Open for Mingling + Pizza\n19:00 - Talk: **Bake, Don't Fry: Astro & The Content Delivery API**\n19:30 - Talk: **Deep Dive into the Umbraco Headless Demo**\n\nEntry: Go to reception, there will be someone there to guide you to where the event is taking place.",
                "dateTime": "2024-05-23T18:30+01:00"
              }
            },
            {
              "node": {
                "id": "300167069",
                "title": "Workshop Special - Getting Started with the new Back Office in Umbraco 14",
                "description": "Join us for an exclusive in-person workshop at CTI Digital, dedicated to exploring the giant leap Umbraco is making with next month's upcoming release: Umbraco 14. This version introduces an updated back office, leveraging cutting-edge frontend technologies such as TypeScript, Lit, and Vite to deliver a more modern, efficient, and developer-friendly experience.\n\nAs Umbraco embarks on this significant transition, it's imperative for our community to stay ahead of the curve. This workshop will follow Kevins Jump's recent [blog post series](https://dev.to/kevinjump/series) to help Umbraco developers get acquainted with the new back office's setup, functionalities, and the nuances of working with property editors, dashboards and workspaces.\n\n**What We Offer:**\n\n* A walkthrough of the new back office setup process\n* Hands-on guidance on leveraging the new frontend technologies within Umbraco 14\n* Expert support to answer any questions and assist in troubleshooting issues\n\nOur goal is to ensure you leave the workshop not just with theoretical knowledge but with a working implementation you can build upon.\n\n**Who Should Attend:**\n\nGear up to dive deep into Umbraco 14's new back office, exploring its modern frontend technologies like TypeScript, Lit, and Vite. This session is particularly beneficial for those looking to get hands-on experience and insights into setting up and working with Umbraco's latest iteration.\n\n**Why It's Worth Attending:**\n\nThis is a unique opportunity to:\n\n* Gain firsthand experience with Umbraco 14's new back office before its official release\n* Enhance your skill set with modern frontend technologies such as TypeScript, Lit, and Vite\n* Network with fellow Umbraco community members and experts\n* Walk away with a solid foundation and a working example of the new back office\n\nPlease note, to ensure a productive and hands-on experience for everyone, we are limiting the number of participants to 15. This will allow each attendee to have a dedicated workspace and receive personalised assistance.\n\nDon't miss this chance to explore the future of Umbraco. Reserve your spot today and take a giant leap forward in your Umbraco journey!",
                "dateTime": "2024-04-18T18:00+01:00"
              }
            },
            {
              "node": {
                "id": "299649247",
                "title": "Rick B: TypeScript+Content Delivery API & Lisa M: Design and neurodiversity",
                "description": "**Introduction**\n\nAfter a couple of years hosting events in person, for one month only, we're going virtual again! This month, we're super excited to have Rick Butterfield and Lisa Matthews back with us. But this time, it's all happening online. No need to travel; just grab a cuppa, get comfy at your desk, and join us from wherever you are. It's going to be a bit different, but absolutely brilliant.\n\nRick will be showing how we can combine the Content Delivery API and Webhooks to generate strongly Typed Models to generate static websites. This talk covers key ideas to speed up our time to getting Content Delivery API powered websites up and running.\n\nLisa will be sharing her experiences as a neurodiverse content professional and highlighting examples of great functionality that empower not just neurodiverse users but everyone.\n\n**Rick Butterfield: Generating a TypeScript OpenAPI client from Umbraco's Content Delivery API**\n\nThe launch of Umbraco 12 saw the release of the powerful Content Delivery API. Combined with Webhooks introduced in Umbraco 13, this makes an impressive combo for working with statically generated websites.In this talk, we'll explore the practical step-by-step process of setting up a website (Astro in this demo) to use Umbraco's Content Delivery API by dynamically generating a TypeScript client using \\`openapi-typescript-codegen\\`.We'll also discover how including other community packages can enhance the workflow by generating strongly typed TypeScript models and simplifying the process of building on the front end. Plus, how we can use this same tooling for creating packages for the new Umbraco backoffice, Bellisima!As trends show more developers opting to go headless and use static generation.\n\n**Lisa Matthews: Accessible design, neurodiverse designer**\nAs a neurodiverse content professional working in digital design, I often encounter products and services that leave me exasperated and bamboozled. My design journey began with Windows 95, and the increasing complexity of IoT and software ecosystems has significantly influenced my approach to design, and effect my experience as an end-user of tech. At Nexer Digital, we work as a team to better understand and overcome user experience UX challenges. In this talk, I'll share personal insights and highlight some examples of great functionality that empower not just neurodiverse users, but everyone.\n\n**Who Should Attend:**\n\nThis event is perfect for anyone in the digital space—developers, designers, and content creators interested in the latest web technologies and inclusive design. Learn from Rick Butterfield about leveraging Umbraco's Content Delivery API and TypeScript for more efficient web development, and from Lisa Matthews on making digital experiences accessible and empowering for all users, especially those who are neurodiverse.\n\n**Agenda:**\nThe agenda is for guidance at Umbraco Manchester we can be a bit fluid with times :-)\n19:00 - Welcome\n19:10 - Lisa Mathews: **Accessible design, neurodiverse designer**\n19:30 - Rick Butterfield: **Generating a TypeScript OpenAPI client from Umbraco's Content Delivery API**\n20:15 - informal chat\n\n**Why It's Worth Attending:**\n\nEnhance your skills and projects by applying cutting-edge techniques and inclusive design principles learned here. You'll leave with actionable insights for improving web development workflows and creating more user-friendly digital products, setting you up for professional growth and project success.\n\nWe will share a link to the event nearer the time, please keep an eye on your inbox",
                "dateTime": "2024-03-21T19:00Z"
              }
            },
            {
              "node": {
                "id": "298774501",
                "title": "Dan Lister : Advancing the Umbraco Cloud & Jonny Muir : Develop with purpose",
                "description": "**Introduction:**\n\nThis month, we're really excited and honoured to have our own community member, Dan Lister, talk about the inner workings of Umbraco Cloud. This is a talk we've been eagerly awaiting for years, and it serves as a preview of one he will be giving at Umbraco Spark in March. If you use Umbraco Cloud, this is your chance to get a peek under the hood. For those who haven't yet explored Umbraco Cloud, it's a rare opportunity to gain a more in-depth look at how it works and why you should be using it. And for everyone else, it's a unique and great chance to understand how a global scalable solution that hosts thousands of sites operates.\n\nWe also have Jonny Muir giving an insightful short talk about how to successfully run a development team.\n\n**Dan Lister - Advancing the Umbraco Cloud Platform: Innovations in Availability, Deployment and Scalability with Terraform, Azure DevOps, and Kubernetes**\n\nDive into the inner workings of Umbraco Cloud's Platform transformation in this talk. See our hands-on approach to deploying and managing cloud infrastructure using Terraform. See how we use of rapid release cycles with Azure DevOps, minimising deployment times while maintaining quality and security.\n\nExplore our journey leveraging Azure Kubernetes Services for global scalability and high availability. Witness the integration of Azure API Management in streamlining interactions between our services, enforcing policies, and ensuring a secure, unified API gateway.\n\nGain firsthand insights into how Umbraco Cloud's Platform Team innovatively wields these tools, offering practical knowledge for your own cloud environments.\n\n**Jonny Muir - Develop with Purpose**\n\nCreating safe, purposeful environments in software development is not just about clean code or efficient processes; it's about cultivating a space where developers are empowered to do meaningful work that they care about, reflecting the principles of Agile and humanistic values.\n\n**Who Should Attend:**\n\nWhether you're new to Umbraco or a seasoned professional, this event is perfect for anyone interested in the platform. It's a unique opportunity to gain insights into the latest developments, share experiences, and network with peers in the industry.\n\n**Why It's Worth Attending:**\n\nThis meetup is more than just listening to talks. It's a chance to connect with the community, learn from experts, and engage in meaningful discussions about Umbraco and software development. Attend to expand your knowledge, meet fellow enthusiasts, and be part of the vibrant Umbraco community.\n\n**Agenda:**\n18:30 - Open for social and mingling (+ food/drink)\n19:00 - Dan Lister : **Advancing the Umbraco Cloud Platform: Innovations in Availability, Deployment and Scalability with Terraform, Azure DevOps, and Kubernetes**\n20.00 - Jonny Muir : **Develop with Purpose**\n\n**Entry:**\nGo to reception, there will be someone there to guide you to where the meetup is taking place.",
                "dateTime": "2024-02-22T18:30Z"
              }
            },
            {
              "node": {
                "id": "298419288",
                "title": "So you think you know how to debug: Talk and Discussion",
                "description": "**Details**\nAn exploration into the world of software debugging, tailored for the Umbraco community.\n\nThe evening will centre around understanding debugging, a crucial aspect of software development. We'll delve into why debugging is essential, how it differs from unit testing, and its impact on the quality of software. The discussion will broaden to encompass various debugging tools across multiple platforms, including C#, Azure Portal, Umbraco, and Browser Debugging. We will also cover specific tools like Sonar Cloud, SSMS, and Playwright.\n\nWe will also explore the finer points of logging and performance, including memory performance management with tools like dotMemory. Alongside more advanced techniques involving Linq, Tracing (dotTrace), and Dotpeek\n.\n**Open Forum Discussion:** Drawing from the success of our previous meetups, this event will be a relaxed, open forum for discussion. It's an opportunity for everyone to share questions, experiences, and insights.\n\n**Interactive Sessions**: Speakers will present real-world examples, common patterns, and essential concepts in a relaxed, interactive setting.\n\n**Who Should Attend**\nThis event is for everyone interested in Umbraco, from newcomers to experienced professionals. It's a chance to gain new insights, share experiences, and network with peers in the industry.\n\n**Why It's Worth Attending**\nThe meetup is an opportunity to deepen your understanding of debugging in a friendly, collaborative environment. It's about community learning, sharing experiences, and connecting with others who share your interest in Umbraco and software development.\n\n**Agenda:**\n18:30 - Open for social and mingling (+ food/drink)\n19:00 - Talk and Open Discussion: Debugging Techniques and tools for 20:30 - Open social\n**Entry:**\nGo to reception, there will be someone there to guide you to where the meetup is taking place.",
                "dateTime": "2024-01-18T18:30Z"
              }
            },
            {
              "node": {
                "id": "296873710",
                "title": "Festive Meal, with Dot Net North",
                "description": "Main event:\n7:00PM: Meal at **Society**,\nBasement, 100 Barbirolli Square, Manchester M2 3BD.\nSee: [https://www.societymanchester.com/](https://www.societymanchester.com/)\n(food and drink is to be paid for, at your expense)\n(Optional)\n9:00PM: Post-meal drinks\nCo-hosted with [Dot Net North Meetup](https://www.meetup.com/dotnetnorth/)\nSociety is a bar and food venue. There are several food vendors in the space so you choose what you fancy to eat - burgers, Indian, pizza, and Korean.\nWe've booked a table so we can all sit together - you can order food whenever you want, there's no fixed time we will eat.",
                "dateTime": "2023-12-05T19:00Z"
              }
            },
            {
              "node": {
                "id": "296873604",
                "title": "Umbraco and Sustainability: Talks By Terence Burridge and Ali Graham",
                "description": "**Details**\n**Terence Burridge: Can you skip your Pi and not eat it?**\nComparing and challenging the Raspberry Pi against other devices for running Umbraco. Since the move by Umbraco to .NET core, and the better opening up of Linux as a platform, a default position which is often fallen to by developers is 'Hey, I can now host this on a Raspberry Pi', largely as it has the biggest name recognition. In his talk Terence challenges this position, exploring if there are better options out there for developers who want to run Umbraco on their own low-cost platforms. Terence compares the use of Pi to run Umbraco to a variety of other cheap and recycled mini PC platforms, such as repurposed Android TV boxes, thin clients and repurposed ex-corporate workstation machines. Considering the wider sustainability benefits if of giving an existing 'old' device a new lease of life.\n\n**Ali Graham (AND Digital): Sustainable Software Engineering.**\nSustainability is hard as everyone thinks about it differently, in this talk we will explain some principals and what you can do as a developer to think about sustainability all the way through your project.\n\n**Agenda:**\n18:30 - Open for social and mingling (+ food/drink)\n19:00 - Talk - Terence Burridge: Can you skip your Pi and not eat it?\n19:45 - Talk - Ali Graham (AND Digital): Sustainable Software Engineering.\n20:15 - Open social\n\n**Entry:**\nGo to reception, there will be someone there to guide you to where the meetup is taking place.",
                "dateTime": "2023-11-16T18:30Z"
              }
            },
            {
              "node": {
                "id": "296214145",
                "title": "Special Event - Umbraco Commerce with Matt Brailsford & Ollie Picton",
                "description": "**Event Overview:**\nJoin us for an evening dedicated entirely to Umbraco Commerce, the powerful and flexible e-commerce solution for the Umbraco platform. Whether you’re an experienced Umbraco developer or just curious about the latest in e-commerce tech, this event promises in-depth insights and real-world applications of the platform.\n\n***\n\n**Agenda:**\n6:00 PM - 6:45 PM: **Registration, Networking and Food**\n\n6.45 PM - 7:15 PM: **Getting your head around headless commerce** **with Matt Brailsford**\nIt seems like everything is going headless these days and Umbraco is no different. v12 saw the launch of the new Content Delivery API, but that's not the only Umbraco product going headless.\n\nIn this session we'll explore the new headless Storefront API coming to Umbraco Commerce real soon. We'll see what is possible, why it's important we go headless, and take a look at a real world demo.\n\n7:15 PM - 7:30 PM: **Break**\nRefreshments provided.\n\n7:30 PM - 8:00 PM: **Umbraco Commerce Case Study with Oliver Pictor**\nOliver Pictor, a seasoned expert with extensive experience with Vendr and an early adopter of Umbraco Commerce, shares a compelling case study. Discover the challenges, successes, and lessons learned from integrating and scaling Umbraco Commerce in the real world.\n\n8:00 PM - 8:20 PM: **Q&A and Open Discussion**\nHere's your chance to ask Matt, Oliver, and other attendees about their experiences, share your own, and discuss the future of Umbraco Commerce.\n\n8:30 PM Onward: **Informal Networking at Crown & Kettle**\nStick around, continue the conversation, and make new connections in the Umbraco community.\nhttps://maps.app.goo.gl/63T6DxZrCCpQf7Mu6\n\n**Entry:**\nGo to reception, there will be someone there to guide you to where the talks are taking place.\n\n**Additional Details:**\n\n* **Who should attend?** This event is perfect for developers, digital agency professionals, business owners, and anyone interested in e-commerce solutions powered by Umbraco.\n* **Cost:** Free (but please RSVP so we can ensure enough seating and refreshments)\n* **RSVP:** Please confirm your attendance\n\n**Special Note: In Conjunction with an Umbraco Event**\n\nBefore our evening meetup, [Umbraco and CTI Digital](https://umbraco.com/campaign/commerce-drinks-a-event-by-umbraco-and-cti-digital/) are hosting a special Umbraco Commerce event starting at 3 pm. While both gatherings cater to the same passion for Umbraco Commerce, they are distinct and offer different perspectives and insights. We warmly invite you to enrich your experience by attending both events on October 5th, ensuring a comprehensive dive into all things Umbraco Commerce.\n\n**Our Sponsors:**\n\nBig thanks to CTI Digital for hosting us and providing the venue. If you're interested in sponsoring or hosting future events, please get in touch.",
                "dateTime": "2023-10-05T18:00+01:00"
              }
            },
            {
              "node": {
                "id": "295659719",
                "title": "Integrating with Umbraco: Talk and Discussion",
                "description": "Built atop the robust C# and .NET platforms, Umbraco is not just a standalone CMS. It's been meticulously crafted to integrate seamlessly with other systems, positioning itself as a vital cog in any digital experience platform.\n\nFor this meetup we wanted to share practical tips and strategies for building integrations into and with Umbraco. Our speakers will give a talk that covering essential concepts, common patterns and real-world examples. The structure of the talk will be more relaxed than usual. We welcome audience participation, asking questions, and sharing experiences. Anything learned that would benefit the community is encouraged to be shared.\n\nThis event is designed for both Umbraco newcomers and seasoned professionals, offering valuable insights and opportunities to expand your knowledge. Join us to engage in a lively conversation about Umbraco.\n\nWe ran a session like this earlier in the year discussing structuring content and we thought it was very successful with plenty of experiences shared and ideas debated. It's something that we wanted to do again but with a different subject matter.\n\nWe look forward to seeing you there!\n\n**Agenda:**\n\n18:30 - Open for social and mingling (+ food/drink)\n\n19:00 - Talk and Open Discussion - Integrating with Umbraco\n\n20:30 - Open social\n\n**Entry:**\n\nGo to reception, there will be someone there to guide you to where the meetup is taking place.\n\n**Sponsors**\n\nWith thanks to [https://www.thisisabsurd.com/ ](https://www.thisisabsurd.com/) for providing the venue, food and drink",
                "dateTime": "2023-09-20T18:30+01:00"
              }
            },
            {
              "node": {
                "id": "294056827",
                "title": "Lightning Talks",
                "description": "We're excited to announce the detailed speaker line-up for our upcoming meetup at Bright HR. Each session promises to be a deep dive into key topics surrounding the latest Umbraco trends.\n\n**Adam Taylor and Kat Dixon** from CTI Digital will lead an engaging session on how to adopt Umbraco especially considering the new release of Umbraco12, along with sharing use-cases of AI within the system.\n\n**Gwyl Richards** from Brace Digital will provide a comprehensive look at the current Umbraco API controller, along with insights into the new delivery API. This session is critical for developers looking to get ahead of the curve.\n\n**Grey Muir** from Cantarus is set to discuss the possibilities of scaling component driven content blocks using AlpineJS. Their session will provide an overview of how to use AlpineJS with the Content Blocklist to produce modular JS for Blocklist items that can be lazy-loaded on an ad-hoc basis.\n\n**Dan Lister** from Umbraco himself will guide us through a journey exploring the new features coming to Umbraco Cloud. He'll also demonstrate the process of Custom CI/CD Integration, offering a sneak peek into the future of Umbraco Cloud.\n\nLastly, **Jon Whitter** from Cantarus will introduce a new package they've been working on that streamlines email sending within the code. His talk promises to give us an in-depth look into the back office control of email content and extensions used with external email platforms.\n\n**Agenda:**\n18:30 - Open for social and mingling (+ food/drink)\n19:00 - Lightning Talks\n20:45 - Open social\n\n**Entry:**\n\nGo to reception, there will be someone there to guide you to where the meetup is taking place.",
                "dateTime": "2023-07-20T18:40+01:00"
              }
            },
            {
              "node": {
                "id": "293211019",
                "title": "Adam Prendergast & Pritesh Tailor:Just Say No 2 Rebuilds - Strangler Fig Pattern",
                "description": "**Details**\n\"This project needs a rebuild!\" Have you ever heard this crazy statement? A decision born out of frustration. A need to modernize, but the upgrade path ahead is daunting and nearing the impossible. With a rebuild you will also lose all the hard work that has gone into an application over many years. Those \"oh, I forgot it did that too!\" moments that cause sweaty palms and creeping budgets. There is another way. We present the \"The Strangler Fig\" pattern. Taking a complex Umbraco application from V7 to V11. Incrementally migrating over time without dropping features and releasing value to the client early. This approach is not without its own challenges though. In code, infrastructure, client buy-in and most importantly, compromise. We will take a deep dive into an array of gotchas and considerations with practical approaches to solving challenges and allow you to bring more control, rigor and reassurance when migrating large, complex projects with the Strangler Fig pattern.\n\n**Agenda:**\n18:30 - Open for social and mingling (+ food/drink)\n19:00 - Talk - Adam Prendergast - Just Say No To Rebuilds - The Strangler Fig Pattern\n19:45 - Talk - Greg Nutall - Wolverine: The superhero of message queues\n20:00 - Open social\n\n**Entry:**\n\nGo to reception, there will be someone there to guide you to where the meetup is taking place.",
                "dateTime": "2023-05-25T18:30+01:00"
              }
            },
            {
              "node": {
                "id": "292960069",
                "title": "How to Structure Your Content in Umbraco: Talk and Discussion",
                "description": "For this meetup we wanted to do something a different. Our speakers will give a talk that shares practical tips and strategies for effectively structuring your content in Umbraco, covering essential concepts, common patterns and real-world examples. After the talk, we'll transition into an interactive discussion, allowing you to ask questions, share your own experiences, and learn from fellow Umbraco users.\n\nThis event is designed for both Umbraco newcomers and seasoned professionals, offering valuable insights and opportunities to expand your knowledge. Join us to enhance your content structuring skills, network with like-minded individuals, and engage in a lively conversation about Umbraco.\n\nWe look forward to seeing you there!\n\n**Agenda**:\n18:30 - Open for social and mingling (+ food/drink)\n19:00 - Talk - How to Structure Your Content in Umbraco\n19:30 - Open Discussion - How do you structure your content in Umbraco\n20:00 - Open social\n\n**Entry:**\nGo to reception, there will be someone there to guide you to where the meetup is taking place.",
                "dateTime": "2023-04-26T18:30+01:00"
              }
            },
            {
              "node": {
                "id": "292129082",
                "title": "Dan Lister: Exploring Umbraco Cloud's Newest Features",
                "description": "This event is taking part after a [Digital City Festival](https://www.digitalcityfestival.com/) Fringe event hosted by Umbraco and CTI Digital **[Identify the right path for your projects running on Umbraco 7 or older versions](https://umbraco.com/campaign/upgrades-drinks-a-fringe-event-by-umbraco-and-cti-digital/)**.\n\nIn this Month's talk, Dan will be showing us all the great advancements made in Umbraco Cloud this year (and it's only March) and sharing what's coming up next with us. If you've already discounted Cloud as not for you, then this a great opportunity to hear how far it's come and take another look.\n\n**Agenda**:\n18:30 - Open for social and mingling (+ food/drink)\n19:00 - Talk - Dan Lister - Exploring Umbraco Cloud's Newest Features\n19:45 - Talk - Jon Whitter - Intro/whistle stop tour of the Polly library\n20:00 - Open social\n\n**Entry:**\nGo to reception, there will be someone there to guide you to where the talks are taking place.",
                "dateTime": "2023-03-29T18:30+01:00"
              }
            },
            {
              "node": {
                "id": "291222758",
                "title": "Rick Butterfield: Decarbonising the planet, one Umbraco upgrade at a time",
                "description": "The internet emits a truly enormous amount of CO2. Indeed, it’s estimated that across the world, the collective carbon consumption of the internet is equivalent to that of the entire airline industry (Source: ClimateCare) - that’s around 3.7% of all global emissions (Source: BBC).\n\nOn the release of .NET 5, Microsoft announced it would be up to 50% faster than the previous version. As such, when Umbraco released version 9 it was expected that this version was between 1.5x and 2x more performant than Umbraco v8. For organizations, this meant upgrading their site from v8 to v9 had the potential to halve their hosting costs. From these metrics we hypothesized that upgrading to v9 could lower the overall carbon emissions of a website. In this talk you'll hear about the journey we took with our client and whether our hypothesis was true or not.\n\n**Agenda**:\n18:30 - Open for social and mingling (+ food/drink)\n19:00 - Talk - Decarbonising the planet, one Umbraco upgrade at a time\n19:45 - Second micro talk - TBC\n20:00 - Open social\n\n**Entry:**\nGo to reception, there will be someone there to guide you to where the talks are taking place.",
                "dateTime": "2023-02-16T18:30Z"
              }
            },
            {
              "node": {
                "id": "290723209",
                "title": "Umbraco: From meetup attendee to MVP",
                "description": "Have you always wanted to learn more about Umbraco or get involved in the Umbraco community? Then this meetup is for you.\n\nUmbraco Manchester organisers, and Umbraco MVPs Phil Whittaker and Rachel Breeze are giving a talk at [Nexer Digital](https://www.nexerdigital.com/) about the benefits to developers, the wider development team and employers of attending Umbraco Meetups.\n\nThey will also share their stories of how attending meetups helped encourage them to give back to the development community, leading to becoming Umbraco MVPs.\n\n**Agenda:**\n\n* 12-00 - Open for social and mingling\n* 12-30 - Talk - Umbraco: Meetup attendee to MVP\n* 13-15 - Open social\n\n**Entry:**\n\nTaking the Newton St. entrance, head to the main reception. Someone will be there to greet you and direct you to the Nexer Digital offices. The event will be held in the Jodrell conference room which will be signposted on arrival.\n\n**About the venue:**\nThe talk will be hosted at Nexer Digital office in Macclesfield. The full address is:\nThe Ropewalks,\nNewton St,\nMacclesfield SK11 6QJ\nOnsite parking is limited, but there is a nearby carpark on Churchill Way near Tesco.\nStep free access is available at The Ropewalks with lift access to the Nexer offices.",
                "dateTime": "2023-01-31T12:00Z"
              }
            },
            {
              "node": {
                "id": "289765324",
                "title": "Christmas Social at Society",
                "description": "We've booked a table for 12 between 7 pm and 9 pm at [Society](https://www.societymanchester.com/) next to the Bridgewater Hall in Manchester city centre. They have a good range of beers, mostly from Vocation brewery based in Hebden Bridge, and five food stalls serving Burgers, Pizza, Indian, Japanese and Korean. Hopefully, there should be enough choices to cover everyone with plenty of vegetarian and vegan options available.\n\nAfter Society, we'll likely go to another venue in the same area.",
                "dateTime": "2022-12-08T19:00Z"
              }
            },
            {
              "node": {
                "id": "289447034",
                "title": "Sean Holcroft : Deploying Umbraco 10 using Azure DevOps",
                "description": "Sean is a Security Architect at BrightHR. He used to work with Umbraco and is looking forward to using his current skillset to help people to understand how to use Azure DevOps to deploy Umbraco 10 consistently.\n\nWe’ll look at builds, unit testing and deployment and maybe throw in some slack notifications to let your colleagues or clients know something has shipped!\n\nPhil Whittaker will also be giving a brief introduction to Mocking with AutoFixture.\n\nAgenda:\n\n1830 - Open for social and mingling (+ food/drink)\n1900 - Talks\n\\- Deploying Umbraco 10 using Azure DevOps\n\\- Simplified mocking with Autofixture\n2000 - Open social\n\nEntry:\n\nGo to reception, there will be someone there to guide you to where the talks are taking place.",
                "dateTime": "2022-11-10T18:30Z"
              }
            },
            {
              "node": {
                "id": "288022232",
                "title": "In Person : You're already doing DXP - you just didn't know it",
                "description": "At Codegarden this year, much talk was about (composable) DXP (Digital Experience Platforms). We will explore what (composable) DXP (Digital Experience Platforms) is, how they relate to Umbraco and why you're probably already using Umbraco as a DXP. Finally, we'll discuss where we see the future of DXP.\n\nOur first in-person meetup since lockdown is happening in September at our new venue, Autotrader. We're looking forward to seeing everyone again, and we are looking forward to some great talks and informal chats.\n\nAgenda:\n\n1830 - Open for social and mingling (+ food/drink)\n1900 - Talk - You're already doing DXP - you just didn't know it\n2000 - Open social\n\nEntry:\n\nGo to reception, there will be someone there to guide you to where the talks are taking place.",
                "dateTime": "2022-09-15T18:30+01:00"
              }
            },
            {
              "node": {
                "id": "279143614",
                "title": "Umbraco 9 Informal Chat",
                "description": "With Umbraco 9 a few months old now, we thought it a good idea to have an informal chat about Umbraco 9 and your thoughts so far.\n\nDo you have any reservations about using it?\nWhen will you start using it?\nHave you used it on any sites yet?\nDo you have any experiences you can share?\n\nThere won't be any talks this month, just an opportunity for you to ask questions or share and be social",
                "dateTime": "2021-11-18T19:00Z"
              }
            },
            {
              "node": {
                "id": "275047757",
                "title": "The Serverside Strikes Back - Poornima Nayar and Chriztian Steinmeier",
                "description": "It's fair to say the frontend client-side technologies are at a forefront of web development today. Their explosive growth and ease of use have meant that 1000's of websites are built using technologies such as React, Vue and Svelte. These frameworks have brought about new possibilities; microservices, static site generation, micro frontends and more. Serverside technologies feel demoted to just supplying data to power these frameworks.\n\nBut the last couple of years has seen a new type of framework emerge. Using Javascript in simpler ways or ignoring it entirely, making use of web sockets to drive the frontend. Unified and simplified codebases that start to solve some of the problems associated with these client-side frameworks.\n\nIs the tide turning? Does this mean that serverside technologies will come to the forefront again?\n\nThis evening there will be two speakers talking about two of these frameworks (Turbo and Blazor) and how they work with Umbraco.\n\nPoornima Nayar\n\nAbout the talk:\n\nBlazor is a framework for building interactive client-side web UI with .NET. In my session we will have a quick intro to Blazor. We will discuss the different flavours of Blazor, how we can use Blazor with Umbraco and we will also discuss some of the changes coming to Blazor with .NET 6.\n\nWho am I?\nPoornima is a .Net developer with over 10 years of experience in .Net and Umbraco. She is passionate about learning new technologies and keeping herself up-to-date with the latest developments in technology. Outside her work, Poornima enjoys music and is undergoing training in Indian Classical music. Based in Langley, UK she mothers a little girl and spends her spare time reading, cooking and watching movies.\n\nChristian Steinmeier\n\nAbout the talk:\nI'll give a run-down of what Turbo is - where it came from and how it works; and then we'll take a look at how to use it in our Umbraco projects, what to look out for and maybe when not to use it.\n\nWho am I?\nI am a frontend developer at Vokseværk in Denmark, having worked almost exclusively on Umbraco websites for more than 10 years. I have presented at Codegarden multiple times on various topics from XSLT and CoffeeScript to dealing with imposter's syndrome and contributing to open source projects like Umbraco CMS.",
                "dateTime": "2021-09-16T19:00+01:00"
              }
            },
            {
              "node": {
                "id": "275047707",
                "title": "Codegarden discussion and roundtable",
                "description": "You'll have had a week to process all the news, happenings and great talks at this years Codegarden. Here's a chance to chat about the conference, share your favourite moments or, if you couldn't make it, find out the best talks to catch up when the videos come out in a few weeks.",
                "dateTime": "2021-06-17T19:00+01:00"
              }
            },
            {
              "node": {
                "id": "275047515",
                "title": "Sam Mullins : xStatic - static site generation for Umbraco",
                "description": "This month we'll be welcoming to Sam Mullins talk about his new package xStatic which simplifies static site generation for Umbraco.\n\nAgenda:\n- Welcome & Introductions\n- Umbraco News & Upcoming Events\n- Main Talk: xStatic - static site generation for Umbraco\n- Break\n- Social\n\nSam works for Bournemouth based digital agency Redweb. Despite currently working primarily with Sitecore, he has used Umbraco for over 10 years and recently decided to use it for his own personal site. As well as open-sourcing a couple of Umbraco projects Sam has also released open-source plugins for the photo editor CaptureOne and also made a covid safe party game, \"The Imposter\".\n\n** Main Talk **\nSam Mullins: Using and Extending xStatic\n\nIn order to save on hosting costs, Sam created xStatic for Umbraco, a completely free and open-source static site generator that can be configured to deploy a Umbraco website to Netlify, GitHub pages or a traditional server using FTP.\n\nIn this session, we'll briefly go over how to set up xStatic on your site and talk through the different deployers and transformers that are built into the product. We'll then create a new custom deployer and transformer to show how you can easily extend xStatic to fit your needs.",
                "dateTime": "2021-03-18T19:00Z"
              }
            },
            {
              "node": {
                "id": "273931246",
                "title": "Perspectives on Modelling Content in Umbraco",
                "description": "This talk will follow the journey of content from intent to implementation. Three speakers will give their perspectives on different stages of the journey - from helping businesses to design strategic content, to creating flexible storage patterns and finally to bringing presentation to life. The journey is not always smooth and this talk will highlight some of the common problems and pitfalls and signpost some methods and tools that might make the journey a little easier, including:\n\n- How content designers help businesses to shape and prioritise content to meet strategic goals\n\n- How content designers and developers might collaborate more effectively by using documentation and diagramming techniques common in other areas of software development, including Entity Relationship diagrams and UML class models\n\n- Distinguishing between content models and presentation models\n\n- The good and bad of the new breed of Headless CMS (such as Umbraco Heartcore), changing our way of thinking - forcing us to separate content models from presentation models.\n\n- Making the journey adaptable to change - diversions, backtracking and re-navigating the route\n\nLisa Matthews (Senior Content Designer at Sigma) and Justin Darley (Content Team Lead at Sigma) will give an overview of the role of content designers and how content designers work with developers and other members of a typical CMS project team.\n\nSam Flanagan (Technologist / Solution Architect) will look at some common approaches to structuring the storage of content within a CMS. He will highlight some of the differences between creating content domain models and presentation models and examine some common pitfalls and content structure anti-patterns. The talk will go on to look at some processes and documentation methods that might help to improve communication and collaboration between members of the CMS project team. This will include looking at the limitations of site maps and show some examples of more evolved documentation to describe content structure with Entity Relationship diagrams and UML class models.\n\nPhil Whittaker (Umbraco expert and front end specialist) will explore the relationship between content models, content authoring experience and design implementation. Setting out strategies for mapping content models into presentation models and discussing the point at which content modelling becomes the wrong tool.\n\nAfter the talks, we would like to hold a structured open discussion where anyone will be able to comment or ask questions of the speakers. We understand that content modelling can be a very personal process and we would love to hear about other processes and experience.",
                "dateTime": "2021-01-21T19:00Z"
              }
            },
            {
              "node": {
                "id": "272957299",
                "title": "Breaking Up With Your Umbraco Frontend ",
                "description": "Tom Searle, Head of Development at Cold Banana, will give a technical talk on using Umbraco Heartcore to decouple your backoffice and the benefits of static sites.\n\nTom will discuss building static sites using current-generation javascript frameworks with Umbraco. He will aim to spread light on how Umbraco Heartcore can future-proof websites and improve the developer experience. Followed by a dive into a demo store app built using Nuxt and Umbraco Heartcore.",
                "dateTime": "2020-10-15T19:00+01:00"
              }
            },
            {
              "node": {
                "id": "271517484",
                "title": "Campaign Builder with Umbraco Content Apps",
                "description": "Luke Fribbens, Founder and Managing Director of Cold Banana, will be giving a talk about using the new Content Apps feature in Umbraco.\n\nUmbraco Content Apps introduces a new way of integrating and extending core CMS elements.\n\nLuke and his team had the challenge of combining the campaign capabilities of platforms like Dotdigital with the CMS power of Umbraco. Luke will take us through a case study of how his team used the power of Content Apps to deliver a fully integrated campaign workflow builder for a global brand.\n\nThis talk is intended to inspire the use of Content Apps, by giving a real example. Who said Content Apps had to be boring?",
                "dateTime": "2020-07-16T19:00+01:00"
              }
            },
            {
              "node": {
                "id": "269836055",
                "title": "***Online Event*** Umbraco - the V8 Way!",
                "description": "*** ONLINE EVENT ***\n\nPoornima Nayar, Umbraco, the V8 Way!\n\nUmbraco v8 is a big jump compared to v7, from the polished back office to some of the new and advanced developer features. Poornima will discuss some of the new concepts in Umbraco v8 and some of the features that have changed compared to v7.\n\nAgenda:\nJoin us on Zoom for a chat from ~18:30\nPoornima's talk will start around 19:00\nGroup Chat - from 19.40",
                "dateTime": "2020-04-23T18:30+01:00"
              }
            },
            {
              "node": {
                "id": "268614373",
                "title": "Umbraco DevOps: hosting and deployments the 2020 way",
                "description": "Our first meetup of 2020 and we are lucky to have Callum Whyte\n(umbraCoffee, Umbraco UK festival organiser and Umbraco MVP) talking about the various options for hosting Umbraco.\n\nAli Graham (Umbraco Leeds Meetup and twentysix) will also be sharing all the happenings from Umbraco Spark in Bristol taking place on the 6th March.\n\nVenue\n\nThis month we're at WeWork in Spinningfields. Upon arrival report to reception (we'll be giving them a list of attendees) and they will be able to direct you to the room.\n\nSchedule\n\nDoors open from 18:00\nIntro and welcome 18.40\nCallum Whyte - Umbraco DevOps 18.50\nAli Graham - Umbraco Spark review 19.30\nNetworking and beers 20.00 - 20.30\n\nTalk details\n\nThe range of options for hosting and deploying Umbraco websites have exploded in recent years. Knowing which options are best for you and where the hell to start can be tricky.\n\nCallum will be doing a deep-dive on everything you ever wanted to know about Umbraco hosting options; from Virtual Machines to Azure App Services to AWS to Umbraco Cloud, and pro-tips for configuring these setups depending on your project needs. We'll learn about the best-practices for handling deployments (via Azure DevOps), storing media and databases, and handling bursts of traffic.\n\nEver wondered what all this Docker, Kubernetes, \"serverless\" stuff we keep hearing about is, and how it fits into the Umbraco world? Callum will aim to demystify these technologies and explore how they will have an impact on our setups in the coming months and years.\n\nThere will be plenty of opportunity for Q&A about your own specific needs and experience too!",
                "dateTime": "2020-03-11T18:00Z"
              }
            },
            {
              "node": {
                "id": "259500816",
                "title": "Manchester Umbraco Meetup",
                "description": "This time we have something really special, and a format we've not previously tried at the Manchester Meetup...\n\nYuzu Framework Workshop - hands on lab with Phil Whittaker\n\nClosely following on from his talk at this year's Umbraco UK Festival (https://umbracofestival.co.uk/agenda), Bodyless Websites with Umbraco, Phil Whittaker will be running a one-off workshop demonstrating how bodyless sites work in practice. Involving both the frontend and backend we will build a fully functioning website using the Yuzu framework in a few hours! We will go through the basics of how to set up the Yuzu pattern library and integrate with Yuzu using our shiny new Umbraco automation tools. There are also loads of tips for the best structures for setting up sites using Yuzu and how to approach the Zero code Umbraco site integration.\n\nCome along with a laptop that can run Umbraco 8 / VS2017/9 and experience a new and innovative way of building Umbraco websites!\n\nWeWork John Dalton Street.",
                "dateTime": "2019-11-20T18:00Z"
              }
            },
            {
              "node": {
                "id": "259500784",
                "title": "Improving Back Office Accessibility & Lessons I Learned From Surviving Cancer ",
                "description": "We're lucky enough to have 2 great talks lined up for this evening. First, Ross Jamieson and Danny Lancaster will show us how to Improve the Accessibility of the Umbraco CMS Back Office. Second, Tim Payne will talk about his experiences and Lessons I Learned From Surviving Cancer (and How They Apply to Web Development).\n\nFirst talk: A practical step by step guide on how to improve accessibility on your site\n\nRoss Jamieson @RossDoesntKnow\nDanny Lancaster @DLancasta\n\nSynopsis:\nAccording to the Office for National Statistics, there are over 14 million disabled people in the UK, representing around 21% of the population. More than ever before, the need to deliver inclusive, accessible digital products and services constitutes both a moral and a commercial imperative. This session is a practical step by step guide on how you can improve accessibility on your sites in under two hours. The methods demonstrated are easily scalable however but should give anyone (technical or none technical) an indication of how much work is required to make the sites you design and develop, AA compliant.\n\nHaving used Umbraco as our chosen open source CMS at Sigma for nearly 10 years now and with Umbraco version 8 launching at the beginning of 2019 and introducing some great new features, including a revamped back office and better support for multilingual sites. We felt that now was a good time to review the accessibility of the editor experience of Umbraco itself as well. Danny Lancaster (Test Analyst), Rachel Breeze (Senior Developer) and Shane Prendergast (Web Designer and Front-End Developer) from Sigma have teamed up with a number of other Umbraco practitioners from the friendly community and Umbraco HQ to make this happen and will demonstrate some of the techniques used to achieve this as part of this session too.\n\nYou can read more about it here:\n\nhttps://www.wearesigma.com/news/improving-the-accessibility-of-the-umbraco-cms-back-office/\n\nSecond Talk: Lessons I Learned From Surviving Cancer (and How They Apply to Web Development)\n\nTim Payne @attack_monkey\n\n13 years ago, I was diagnosed with Stage IV Cancer after a prolonged period of being a medical mystery. Fortunately I survived, and I learnt a lot along the way. Over the years I’ve come to realise that a lot of the lessons I learnt can be applied to work as well. My talk covers some of those lessons and how you can apply them to a job in web dev!\n\nYou can read more about Tim's story here: https://skrift.io/articles/archive/lessons-i-learned-from-surviving-cancer-and-how-they-apply-to-web-development/",
                "dateTime": "2019-08-21T18:00+01:00"
              }
            },
            {
              "node": {
                "id": "259500699",
                "title": "What is a Server-side Headless CMS?",
                "description": "The meetup capacity has been expanded to allow for no shows. The maximum capacity is 28 so as 40 people have now registered entry will be strictly first-come-first-served.\n\nA new year of Manchester Umbraco Meetups begins with an introduction to using Umbraco as a server-side headless CMS, with Phil Whittaker. We are shortly announcing further dates in advance for the rest of the year. Meetups will now be held quarterly going forward, with a regular format of speaker, followed by round table discussion. As usual, there will also be trips to the pub after for beer and a chat!\n\nPhil Whittaker has spoken at the UK Umbraco Festival and at several other events. As well as being an expert on headless, Phil is also the author of the popular Positional Content package.\n\nPhil says: \"We took the ideas of headless and applied the same principles to server-side Umbraco websites, removing the need for client-side applications such as React, Angular or Vue but retaining all the benefits of complete separation. Why would we do this? Because being headless has many advantages but sometimes using a Javascript framework would either complicate or reduce the effectiveness of a site, e.g. SEO in e-commerce sites. By using Umbraco to do all the engineering; routing, state management, rendering etc, it makes this way of separating very simple to implement and understand.\n\nThe result is a new and exciting way of working with Umbraco.\"\n\nThe round table will also be discussing all the latest news about Umbraco 8 and there will be show and tell opportunities for all!",
                "dateTime": "2019-05-08T18:00+01:00"
              }
            },
            {
              "node": {
                "id": "253125668",
                "title": "Manchester Umbraco Summer BBQ",
                "description": "Join us for Manchester's first Umbraco MEAT-up social, in an evening of amazing food, drinks and great company!\n\nThis event is part of the #umbracoBBQ (https://twitter.com/hashtag/umbracoBBQ) series of events taking over the UK and Denmark this summer!\n\nA variety of food will be available, including a vegetarian option, salads and sides - please get in touch if you have alternative dietary requirements!\n\nThis event is being kindly sponsored by Agidea (https://www.agidea.uk/), McCann Manchester (http://www.mccannmanchester.com/) and Offroadcode (https://offroadcode.com/).\n\nFor more info take a look at umbracobbq.com (https://umbracobbq.com/), follow @umbracoBBQ (https://twitter.com/umbracoBBQ) on Twitter and watch the hashtags #umbracoBBQ (https://twitter.com/hashtag/umbracoBBQ) and #umbMeatUp (https://twitter.com/hashtag/umbMeatUp)",
                "dateTime": "2018-09-07T18:00+01:00"
              }
            },
            {
              "node": {
                "id": "243203364",
                "title": "Just what is uSync? / Panel / Show and Tell",
                "description": "Just what is uSync? and how can it help you keep your developers source control and Umbraco deployments in step? Kevin Jump will present a lightning introduction to the pains of keeping Umbraco Installs synchronised, some source control goodness and a sprinkling of continuous deployment tips for Azure, Octopus or your favourite deployment tool.\n\nPete Duncanson of Offroadcode will join a panel addressing the latest burning issues, including Umbraco package development best practices. Show and tell - a new regular slot where anyone can get up and demo a project or cool technology feature. No need to sweat preparing a presentation, just a slot for informal 5 minute demos.\n\nAUDITORIUM - CO-OP DIGITAL\nThis is located on the 6th Floor at Federation House.\nIt is located next to the Event Space\n(Huge thanks to McCann for organising the venue) As usual, there will be drinks after - location TBC.",
                "dateTime": "2017-09-21T19:00+01:00"
              }
            },
            {
              "node": {
                "id": "235176875",
                "title": "Meetup Rebooted! / Tales from the Code Cabin / Umbraco: Intranet Saviour?",
                "description": "Location\nSpaceportx\n24-26 Lever Street\nManchester\nM1 1DZ\nhttps://spaceportx.com (https://spaceportx.com/)\n\nTimes\n18:30 - 21:00.\nTalks start at 19:00\n\nManchester Umbraco Meetup Rebooted! - Sam Flanagan @samuelflanagan (https://twitter.com/samuelflanagan)\n\nIt's been a while since the last Manchester Umbraco meetup. Sam Flanagan will introduce the rebooted meetup and host a Q&A on the bright new future of the group. Don't miss the chance to have your say!\n\nTales from the Code Cabin - Matt Brailsford @mattbrailsford (https://twitter.com/mattbrailsford)\n\nAs co-founder and co-organiser of the first Code Cabin, Matt will be explaining the ethos behind it, why he wanted to create such an event and how it all went over the 3 nights, with 21 devs, 1 cook, in a cabin! Oh and constant rain, well it was in Wales!\n\nUmbraco: Intranet Saviour? - Alex Flahive @AlexFphoto (https://twitter.com/AlexFphoto)\n\nSharepoint. Sharepoint. Sharepoint. Imagine a world where you can only develop in a system nobody likes or understands. We lived in that world for years and have only recently escaped. Barely alive! Luckily Umbraco came to our rescue. This is the short story behind the new Manchester Fire Service Intranet...\n\nFollowed by...\n\nBeers :) @ Kosmonaut (http://kosmonaut.co/)\n\nSome other stuff...\n\nPlease use the hashtag #ManUmbMeetup (https://twitter.com/hashtag/ManUmbMeetup?src=hash)",
                "dateTime": "2016-11-30T18:30Z"
              }
            },
            {
              "node": {
                "id": "221860356",
                "title": "A/B testing with Umbraco and Pete's 'mystery' talk",
                "description": "Location\nBuilding Blocks\n1 Portland Street,\nManchester\nM1 3BE\nhttp://www.building-blocks.com/contact/\n\nTimes\n18:30 - 21:00.\nTalks start at 19:00\n\nFirst up - Antony Melvin @Antony_Melvin (https://twitter.com/Antony_Melvin)\nYour website works - but can it work harder? Adding A/B & Usability Testing to your website\n\nEvery client is looking for websites that 'work harder' but how do you make a website work harder? The simple answer is to get your visitors to tell you which parts of key pages & call-to-actions work well for them.\n\nA/B testing & usability testing allows you to quickly test whether a new design achieves your aim, whether changing button text or colour will generate more conversions & a range of other UX based tests. Take the guesswork out of your design & confidently propose changes that you know will work.\n\nSecond - Pete Duncanson @PeteDuncanson (https://twitter.com/peteduncanson)\nPete's 'Mystery' talk\n\nAt the minute Pete is caught between a couple of topics one of which is his pending Codegarden talk - so what we'll get I don't know (but I've put him second so he can have a couple of beers first).\n\nFor those who dont know Pete he runs OffroadCode an agency in Huddersfield who specialise in Umbraco dev. Also just today he's got his own hashtag - #UmbracoPeteMeme (https://twitter.com/search?q=%23UmbracoPeteMeme&src=typd)\n\nhttp://photos1.meetupstatic.com/photos/event/7/0/6/c/600_436348780.jpeg\n\nFollowed by...\n\nBeers :) @ Port Street Beer House (http://www.portstreetbeerhouse.co.uk/)\n\nSome other stuff...\n\nThe @ManUmbMeetup account is dead, so please use the #ManUmbMeetup hashtag instead",
                "dateTime": "2015-04-23T19:00+01:00"
              }
            },
            {
              "node": {
                "id": "211937462",
                "title": "Why code first is bad and how you can cache big.",
                "description": "Location\nSpaceport\n24/26 Lever Street,\nManchester,\nM1 1DZ\nhttp://spaceportx.com/\n\nTimes\n19:00 - 21:00\n\nFirst up - Pete Duncacnson @PeteDuncanson\nWhy Code first just doest work....\n\nCode First (defining doctypes, macros, etc. via code rather than using the UI) has been a goal for lots of developers within Umbraco for a few years now, what state is Code First with Umbraco? What benefits can it give? What problems is it trying to solve? Can you really do it? Should you even do it? Pete from Offroadcode has used just about every tool available in the wild on real sites and holds the unofficial title of “Mr USiteBuilder”. Take a tour of what is available, what to try, what to avoid and ultimately hear about how the guys at Offroadcode are currently doing to build their sites. Save yourself weeks of pain and learn from our experience in the trenches.\n\nSecond - Chris Gaskell @CGaskell\nSupercharging Umbraco through caching & reverse proxies\n\nWe'll have a look through the different options available from within Umbraco and .NET such as macro caching, output caching,donut caching and other performance options. We'll see how you can easily implement these and how you can manage them.\n\nBut what when those options just aren’t enough? Or you're scaling an application which you can’t alter?\nRolling in Varnish. Varnish is a reverse HTTP proxy and sits between the user and your application server. Varnish is REALLY FAST and it'll help you scale hugely. It'll also give you some redundancy. You'll have more control, have the ability to develop more complexity and it's cost effective. We'll see that running Umbraco on a modest application server with Varnish will allow you to scale to the demands of the web today.\n\nFollowed by...\n\nBeers :) Location to be announced on the day - but right nearby.\n\nSome other stuff...\n\nThe @ManUmbMeetup account is dead, I've killed it. It's just too hard monitoring two different accounts and trying to remember from which account to respond.\n\nSo please use the #ManUmbMeetup hashtag instead",
                "dateTime": "2014-10-16T19:00+01:00"
              }
            },
            {
              "node": {
                "id": "180206532",
                "title": "AngularJs, custom property editors and Amazon AWS",
                "description": "Everyone's welcome for food and drinks courtesy of Building Blocks from 6pm. The first talk will start at 6:45.\n\nWhats on?\n\nAngular and custom V7 property editors\nMatt Brailsford @mattbrailsford\n\nMatt's going to start with an overview of Angular, starting from scratch. Building on this Matt is going to put together a simple V7 property editor then show some more advanced examples. A good number of people have been asking after Angular and custom property editors so this should really capture the interest.\n\nUmbraco and Amazon\nDan Lister @Dan_Lister\n\nA brief introduction to Amazon AWS and it's many acronyms. Followed by an explanation of different strategies to host Umbraco applications within the cloud. Including single server instances, auto-scaling and load balanced examples. I'll also go through some of the pain and teething problems experienced with deployments, setup and maintenance.\n\nWhere is it?\n\nThe meetup will be held at Building Blocks (http://www.building-blocks.com/). Their offices are on the 1st floor, just inform security you're attending the Umbraco Meetup.\n\n1 Portland Street\nManchester\nM1 3BE\n\nThe nearest train station is Manchester Picadilly (3 min walk).",
                "dateTime": "2014-05-21T18:45+01:00"
              }
            },
            {
              "node": {
                "id": "160905472",
                "title": "Scott Gu, Hanselman and Jon Skeet.",
                "description": "No not really, but I had to come up with a headline that beats the last meetup :-p\n\nAfter the whirlwind of having Niels over last year I thought we’d start with a simple meetup for the first of the year.\n\nStarting at 18:30 on Thursday 13th Feb in the Port Street beer house, we’ll try and take over a corner up stairs. Bring along your laptop if you like and show some of your stuff.\n\nSee you there.",
                "dateTime": "2014-02-13T18:30Z"
              }
            },
            {
              "node": {
                "id": "126941432",
                "title": "An evening with Niels Hartvig. In person! In Manchester!",
                "description": "Well this one really is going to take some beating!\n\nhttp://photos3.meetupstatic.com/photos/event/3/3/9/c/event_253213212.jpeg\n\nNiels Hartvig (@Umbraco) is coming to Manchester!\n\nNiels is the founder of Umbraco and remains the project's heart and soul. Niels started Umbraco out of necessity but has maintained it out of love and now Umbraco has a life far beyond his wildest dreams. Niels is the inspiration behind Umbraco's community focus, its dedication to quality, and its no-compromise approach to simplicity. He can be found improving bits of core functionality as often as he can be found encouraging others to take Umbraco to its limit.\n\nSign Up quick, spaces are strictly limited!\n\nThe agenda from Niels...\n\n\"Moving on\"\n\nJoin me on a quick tour of the Umbraco legacy, all the way from the 1st generation of trying to build a simple but flexible CMS in Classic ASP in 2003, over the 2nd generation of moving it to .NET and open source in 2005, to the 3rd generation of building the worlds most wonderful community and sharing culture. And rather than dwelling in the past, experience what the future of Umbraco looks like as we're standing on the threshold of the next chapter in the Umbraco history with Umbraco 7 and Umbraco as a Service.\n\nWarning: Less powerpoint and more live coding. A rare chance to experience the .NET coding style of Niels Hartvig, that has caused more kittens to die than Justin Bieber.\n\nWhere\n\nWe're using the offices of 'BDP'\n\nBDP11 Ducie Street\nPiccadilly Basin\nManchester\nM1 2JB\n\nThe closest train station is Manchester Piccadilly and for those driving there is parking in the basin behind and many other car parks within a couple of minutes walking.\n\nhttps://www.bdp.com/Studios/UK/Manchester/",
                "dateTime": "2013-10-09T18:30+01:00"
              }
            },
            {
              "node": {
                "id": "121582102",
                "title": "Umbraco by boat. An actual floating boat. Really.",
                "description": "http://photos2.meetupstatic.com/photos/event/d/6/1/2/event_241134802.jpeg\n\nUmbraco Cruising....\n\nAs most of you know (especially if you're a digital business owner in Manchester) the Umbraco Manchester meetup venues are found completely by cheek.\n\nThough not this time…\n\nBlueprint Web Tech has offered to pay for a barge for the next meetup! A proper floating barge from http://www.citycentrecruises.co.uk/ There’s a couple of planned talks (see agenda) and plenty time for a social drink from the on board bar.\n\nThe cruise lasts for 3 hours and sets off from Castle Street, near Albert’s Shed at 6:45pm prompt.\n\nhttps://maps.google.co.uk/maps?f=q&source=s_q&hl=en&geocode=&q=city+centre+cruises&sll=53.476866,-2.256693&sspn=0.002765,0.004077&g=M3+4JR&ie=UTF8&ll=53.478444,-2.2567...\n\nThere is a maximum of 50 people, so places are strictly limited. If you do reserve a place and find you can’t attend please update your RSVP as soon as possible.\n\nIt’ll be one to remember!\n\nWhats on?\n\nCode Garden Recap.\nIsmail Myatt has offered to give us a recap from the annual Umbraco Code Garden conference held a couple of weeks before.\n\nHow are we selling Umbraco?\nMore of a forum rather than a led session. Sam Flanagan will lead the proceedings but perhaps have a think about the following beforehand:\n\n• How do we explain to clients the difference between Umbraco and WordPress? The advantages of Document Types over modules.\n• Any examples of migrations from competitor systems, e.g., Kentico, Sitefinity, etc\n• Any examples of where potential customers have been unconvinced by Umbraco and used a competitor system instead\n• What evaluation methodologies are customers using during the CMS procurement process?\n• Impact of Concorde\n\nChance to network and enjoy a drink...",
                "dateTime": "2013-06-26T18:45+01:00"
              }
            },
            {
              "node": {
                "id": "108900142",
                "title": "Umbraco. It's time to talk it over.",
                "description": "Social Panel\n\nTo try something a bit different this month we're going to run a panel discussion. The evening will be broken into 4 key topics as below, each with 30 minutes of discussion. Remember to bring your questions, the evening will require participation from us all.\n\nWhen: Wednesday 20th March, 7 - 9pm\nWhere: Building blocks Ltd, 1 Portland Street Manchester M1 3BE (It's moved, we needed more space!)\n\nAgenda\n\nUmbraco.Current\nWith Umbraco marching on and new releases surfacing monthly, the talk of v6, v7, v4 being maintained and MVC is the community happy with the direction the platform is taking Umbraco.Live\nHow are people getting on with Umbraco in the production environment? Maintaining, upgrading, scaling and enhancing existing sites can be a challenge. Umbraco.Skills\nWhat do you think of the current skillset in the Umbraco space? Is there a shortage? What's missing to train up those who are new to Umbraco or have been sat on an old version? Did someone say documentation? Umbraco.Next\nThere's always things we wish we had. What's missing from the platform that would be really helpful? What do you think of the MVC implementation, will you even be using it?\nPanel Members\n\nThe panel is made up of a number of key people who have very different experiences of the Umbraco space.\n\nDoug Robar\nOfficial Umbraco Trainer. Certified Umbraco Developer. Umbraco MVP. Family man and photographer.\n@drobar\n\nPete Duncanson\nOwner of @OffroadCode, and an avid coder himself.\n@PeteDuncanson\n\nTim Peel\nDevelopment Manager at CodeComputerlove.\n@timpeel\n\nMatt Brailsford\nMatt has worked for Umbraco directly, loves creating packages and is now working Freelance.\n@mattbrailsford\n\nLee Kelleher\nLee has worked with Umbraco for years and is well known through UComponents fame (and that bit at code garden when V5 was canned)\n@leekelleher",
                "dateTime": "2013-03-20T19:00Z"
              }
            },
            {
              "node": {
                "id": "93309142",
                "title": "Examine from the trenches, widget based websites & pickled eggs!",
                "description": "Whats on?\n\nIsmail Mayat @ismailmayat (https://twitter.com/ismailmayat)\n\nHints and tips from the trenches. A deep grok expedition into examine.\n\nAnyone who's used Umbraco often enough will have bumped into the search. the question is what is the best way to use and manage Umbraco Examine (http://examine.codeplex.com/), the underlying Lucene and the fluent API? How do you specify what's in those indexes, rebuild them and add custom fields? Ismail has a lot of experience with Umbraco search and will share all.\n\nChris Gaskell @CGaskell (https://twitter.com/CGaskell)\n\nA widget based content approach and combining adaptive and responsive techniques.\n\nThis is a showcase of a build that has a slightly different approach to managing its content. The build uses content 'widgets' to construct pages, has a custom caching framework, device detection and dynamic template hierarchies. We will go through the initial designs, technical considerations, development approach and pitfalls found along the way.\n\nPete Duncanson @PeteDuncanson (https://twitter.com/peteduncanson)\n\nPicked egg anyone?\n\nPete is the founder of OffRoadCode (http://offroadcode.com/) who are a Umbraco certified partner. Pete is also obsessed with pickled eggs. We don't yet know what Pete will present but it'll be witty and well worth a listen.\n\nWhere is it?\n\nThe meetup will be held at Amaze. Their offices are on the 6th floor, just inform security you're attending the Umbraco Meetup.\n\nAmaze plc\n6th Floor\nNumber 1 First Street\nManchester\nM15 4FN\n\nPeople driving can park in the Q-Park outside or in the Bridgewater Hall NCP almost directly opposite. The nearest train stations are Oxford Rd, Deansgate and Metrolink @ G-MEX.",
                "dateTime": "2012-12-12T18:30Z"
              }
            },
            {
              "node": {
                "id": "74009332",
                "title": "Four 15 minute talks that should give us something to think about.",
                "description": "You're invited to an evening of mini presentations designed to give enough of an insight to get you thinking. Each presentation will last 15 minutes and have a quick Q&A session.\n\nThe evening will be held in the offices of @CreativeLynx ( http://creativelynx.com/info/ ). They have a great space that's been made available to us on the second floor. On the evening look out for the greater in reception to point you in the right direction. I'd like to say a big thank you to Creative Lynx.\n\nThere'll be beer and pizza supplied by Creative Lynx and we'll nip to the pub afterwards for a chinwag if people fancy.\n\nThe evening starts at 7:15pm and will the talks will finish around 9pm.\n\nSo what's on?\n\nMagical Mystery Talk\n\n@Drobar\n\nDoug's in town carrying out Umbraco training in Manchester. He's coming along and has kindly offered to take a slot. He's on holiday at the minute so hasn't yet planned his talk.... watch this space.\n\nCourier - What About the API?\n\n@DavidIanHughes\n\nCourier; Content change tracking and synchronisation via the Courier API. What can be done to help move content between your environments?\n\nScraping Though. What can you do to make V5 work?\n\n@Stuartq\n\nSome of us had already got so far into V5 there wasn't a way out. This is where Stuart found himself and had to come up with a pretty ingenious solution. Find out how.\n\nNeatly Packaged\n\n@MattBrailsford\n\nSo you want to write packages and share with the community? How do you ensure your package is deployed correctly, how do you support different installations, how do you alter configs? Matts written 20 already (http://our.umbraco.org/member/5518) so should be able to point you in the right direction.\n\nNote: I've disabled the guest functionality. If everyone who's coming can register please it'll allow us to quickly print a list for the buildings fire regulations.\n\nAny questions give me a shout.\n\nThanks,\n\nChris Gaskell @CGaskell",
                "dateTime": "2012-09-10T19:15+01:00"
              }
            },
            {
              "node": {
                "id": "69815222",
                "title": "Whoah! What happened to V5? Bring on the gossip.",
                "description": "6:30 start and we're not doing food as the meetup has got a little big for booking tables!\n\nAll the Code Garden V5 gossip along with a few drinks.\n\nhttp://umbraco.com/follow-us/blog-archive/2012/6/13/v5-rip.aspx\n\nWhat's next for Umbraco, what if you've invested in V5, what if you've sold V5, what's going to change in 4.x and may more bits.\n\nHopefully @MattBrailsford or @leekelleher might show their face and give us some inside gossip!\n\nSee you there.",
                "dateTime": "2012-07-18T18:30+01:00"
              }
            },
            {
              "node": {
                "id": "47494912",
                "title": "Manchester Meetup. V5 presentation by @mattbrailsford from @Umbraco.",
                "description": "The meetup is not in the main office, but is only 2 mins walk away.",
                "dateTime": "2012-02-29T19:00Z"
              }
            },
            {
              "node": {
                "id": "16642941",
                "title": "Meetup for a Meal and Chat Umbraco",
                "description": "http://photos2.meetupstatic.com/photos/event/d/c/2/5/event_21596357.jpeg\n\nThe meetup is at Akbars Manchester.\n\nStarts at 7pm till late with a meal, followed by drinks in the bar afterwards.\n\nAKbars\n73-83 Liverpool Road\nDeansgate\nManchester\nM3 4NQ\n0161 834 8444\nhttp://akbars.co.uk/restaurant.php?id=19\n\n(Opposite the museum of Sicence and Industry)",
                "dateTime": "2011-03-10T19:00Z"
              }
            }
          ]
        }
      }
    }
  }